test_result/fio-3.28-4R5J0001-sr-1G-qd256-num1-128K-3000-WT.txt
fio-3.28-4R5J0001-read-1G-256-1-128K: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=256
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685888,
  "timestamp_ms" : 1750685888853,
  "time" : "Mon Jun 23 21:38:08 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-read-1G-256-1-128K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-read-1G-256-1-128K",
        "filename" : "/dev/sda",
        "rw" : "read",
        "bs" : "128K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "256",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 1126696562,
        "bw" : 1100289,
        "iops" : 8596.012592,
        "runtime" : 953,
        "total_ios" : 8192,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 6613,
          "max" : 934694,
          "mean" : 30021.760864,
          "stddev" : 23071.467168,
          "N" : 8192
        },
        "clat_ns" : {
          "min" : 7901366,
          "max" : 59275929,
          "mean" : 29524609.209106,
          "stddev" : 4492534.651638,
          "N" : 8192,
          "percentile" : {
            "1.000000" : 9895936,
            "5.000000" : 29491200,
            "10.000000" : 29491200,
            "20.000000" : 29753344,
            "30.000000" : 29753344,
            "40.000000" : 29753344,
            "50.000000" : 29753344,
            "60.000000" : 29753344,
            "70.000000" : 29753344,
            "80.000000" : 29753344,
            "90.000000" : 29753344,
            "95.000000" : 29753344,
            "99.000000" : 50069504,
            "99.500000" : 54788096,
            "99.900000" : 58458112,
            "99.950000" : 58982400,
            "99.990000" : 59506688
          },
          "bins" : {
            "7897088" : 1,
            "7962624" : 3,
            "8028160" : 1,
            "8093696" : 4,
            "8159232" : 3,
            "8224768" : 2,
            "8290304" : 3,
            "8355840" : 2,
            "8454144" : 6,
            "8585216" : 6,
            "8716288" : 6,
            "8847360" : 6,
            "8978432" : 5,
            "9109504" : 4,
            "9240576" : 5,
            "9371648" : 5,
            "9502720" : 6,
            "9633792" : 5,
            "9764864" : 6,
            "9895936" : 5,
            "10027008" : 5,
            "10158080" : 7,
            "10289152" : 4,
            "10420224" : 5,
            "10551296" : 4,
            "10682368" : 5,
            "10813440" : 3,
            "10944512" : 3,
            "11075584" : 5,
            "11206656" : 9,
            "11337728" : 7,
            "11468800" : 4,
            "11599872" : 5,
            "11730944" : 5,
            "11862016" : 6,
            "11993088" : 5,
            "12124160" : 6,
            "12255232" : 5,
            "12386304" : 3,
            "12648448" : 3,
            "12779520" : 3,
            "13041664" : 2,
            "13172736" : 3,
            "13303808" : 1,
            "13434880" : 3,
            "13565952" : 2,
            "13697024" : 2,
            "13828096" : 1,
            "13959168" : 2,
            "14090240" : 3,
            "14352384" : 3,
            "14483456" : 1,
            "14614528" : 2,
            "14745600" : 2,
            "14876672" : 3,
            "15007744" : 1,
            "15138816" : 1,
            "15269888" : 3,
            "15400960" : 2,
            "15532032" : 3,
            "15794176" : 2,
            "15925248" : 3,
            "16056320" : 2,
            "16187392" : 2,
            "16318464" : 2,
            "16449536" : 3,
            "16580608" : 1,
            "16711680" : 2,
            "16908288" : 4,
            "17170432" : 3,
            "17432576" : 4,
            "17694720" : 3,
            "17956864" : 3,
            "18219008" : 2,
            "18481152" : 3,
            "18743296" : 2,
            "19005440" : 2,
            "19267584" : 2,
            "19529728" : 3,
            "19791872" : 2,
            "20054016" : 3,
            "20316160" : 4,
            "20578304" : 1,
            "20840448" : 2,
            "21102592" : 3,
            "21364736" : 2,
            "21626880" : 3,
            "21889024" : 2,
            "22151168" : 3,
            "22413312" : 3,
            "22675456" : 2,
            "22937600" : 2,
            "23199744" : 2,
            "23461888" : 3,
            "23724032" : 3,
            "23986176" : 2,
            "24248320" : 3,
            "24510464" : 2,
            "24772608" : 3,
            "25034752" : 3,
            "25296896" : 2,
            "25559040" : 3,
            "25821184" : 1,
            "26083328" : 4,
            "26345472" : 1,
            "26607616" : 3,
            "26869760" : 2,
            "27131904" : 4,
            "27394048" : 1,
            "27656192" : 3,
            "27918336" : 2,
            "28180480" : 3,
            "28442624" : 2,
            "28704768" : 2,
            "28966912" : 10,
            "29229056" : 14,
            "29491200" : 1163,
            "29753344" : 6303,
            "30015488" : 80,
            "30277632" : 10,
            "30539776" : 5,
            "30801920" : 2,
            "31064064" : 4,
            "31326208" : 2,
            "31588352" : 1,
            "31850496" : 2,
            "32112640" : 2,
            "32374784" : 3,
            "32636928" : 2,
            "32899072" : 2,
            "33161216" : 3,
            "33423360" : 3,
            "33816576" : 4,
            "34340864" : 4,
            "34865152" : 5,
            "35389440" : 4,
            "35913728" : 5,
            "36438016" : 3,
            "36962304" : 5,
            "37486592" : 5,
            "38010880" : 4,
            "38535168" : 6,
            "39059456" : 4,
            "39583744" : 5,
            "40108032" : 5,
            "40632320" : 3,
            "41156608" : 5,
            "41680896" : 5,
            "42205184" : 4,
            "42729472" : 4,
            "43253760" : 4,
            "43778048" : 5,
            "44302336" : 5,
            "44826624" : 3,
            "45350912" : 7,
            "45875200" : 3,
            "46399488" : 6,
            "46923776" : 3,
            "47448064" : 6,
            "47972352" : 4,
            "48496640" : 4,
            "49020928" : 4,
            "49545216" : 5,
            "50069504" : 5,
            "50593792" : 4,
            "51118080" : 5,
            "51642368" : 4,
            "52166656" : 4,
            "52690944" : 4,
            "53215232" : 6,
            "53739520" : 5,
            "54263808" : 4,
            "54788096" : 4,
            "55312384" : 5,
            "55836672" : 4,
            "56360960" : 5,
            "56885248" : 4,
            "57409536" : 5,
            "57933824" : 4,
            "58458112" : 5,
            "58982400" : 4,
            "59506688" : 1
          }
        },
        "lat_ns" : {
          "min" : 7952986,
          "max" : 59306920,
          "mean" : 29555041.607056,
          "stddev" : 4490748.684437,
          "N" : 8192
        },
        "bw_min" : 1101056,
        "bw_max" : 1101056,
        "bw_agg" : 100.000000,
        "bw_mean" : 1101056.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 1,
        "iops_min" : 8602,
        "iops_max" : 8602,
        "iops_mean" : 8602.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 1
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 952,
      "usr_cpu" : 8.508403,
      "sys_cpu" : 29.201681,
      "ctx" : 5208,
      "majf" : 0,
      "minf" : 8202,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.195312,
        "32" : 0.390625,
        ">=64" : 99.230957
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.987402,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.100000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 1.049805,
        "20" : 2.343750,
        "50" : 95.629883,
        "100" : 0.976562,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 256,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 7598,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 219535,
      "write_ticks" : 0,
      "in_queue" : 219535,
      "util" : 90.020367
    }
  ]
}

fio-3.28-4R5J0001-read-1G-256-1-128K: (groupid=0, jobs=1): err= 0: pid=83350: Mon Jun 23 21:38:08 2025
  read: IOPS=8596, BW=1075MiB/s (1127MB/s)(1024MiB/953msec)
    slat (usec): min=6, max=934, avg=30.02, stdev=23.07
    clat (usec): min=7901, max=59275, avg=29524.61, stdev=4492.53
     lat (usec): min=7952, max=59306, avg=29555.04, stdev=4490.75
    clat percentiles (usec):
     |  1.00th=[ 9896],  5.00th=[29492], 10.00th=[29492], 20.00th=[29754],
     | 30.00th=[29754], 40.00th=[29754], 50.00th=[29754], 60.00th=[29754],
     | 70.00th=[29754], 80.00th=[29754], 90.00th=[29754], 95.00th=[29754],
     | 99.00th=[50070], 99.50th=[54789], 99.90th=[58459], 99.95th=[58983],
     | 99.99th=[59507]
   bw (  MiB/s): min= 1075, max= 1075, per=100.00%, avg=1075.25, stdev= 0.00, samples=1
   iops        : min= 8602, max= 8602, avg=8602.00, stdev= 0.00, samples=1
  lat (msec)   : 10=1.05%, 20=2.34%, 50=95.63%, 100=0.98%
  cpu          : usr=8.51%, sys=29.20%, ctx=5208, majf=0, minf=8202
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.4%, >=64=99.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=8192,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=1075MiB/s (1127MB/s), 1075MiB/s-1075MiB/s (1127MB/s-1127MB/s), io=1024MiB (1074MB), run=953-953msec

Disk stats (read/write):
  sda: ios=7598/0, merge=0/0, ticks=219535/0, in_queue=219535, util=90.02%